//Валидация введённого значения. Вводится идентификатор документа. Идентификатор должен состоять из четырёх частей по четыре символа,разделённых или не разделённых знаком "-". Допускаются только символы латинского алфавита и числа. Вывести через alert "ведётся поиск", при соответствии введённого значения, или "неверный илентификатор", при несоответствии. При несоответствии снова вывести форму для ввода строки.
const regexp = /^\w{4}.\w{4}.\w{4}.\w{4}$/g;

let str = prompt();

if(regexp.test(str) === true) {
    alert("ведется поиск")
} else {
    alert("неверный идентификатор");
    alert(str = prompt());
}